FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3S-EK2_Atmel_Studio/src/asf/sam/boards/sam3s_ek2/sam3s_ek2.h
/**
 * \file
 *
 * \brief SAM3S-EK2 Board Definition.
 *
 * Copyright (c) 2011 - 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM3S_EK2_H_
#define _SAM3S_EK2_H_

#include "compiler.h"
#include "system_sam3sd8.h"
#include "exceptions.h"

/*
 #define BOARD_REV_A
 */
#define BOARD_REV_B

/*----------------------------------------------------------------------------*/

/**
 *  \page sam3s_ek_opfreq "SAM3S-EK2 - Operating frequencies"
 *  This page lists several definition related to the board operating frequency
 *
 *  \section Definitions
 *  - \ref BOARD_FREQ_*
 *  - \ref BOARD_MCK
 */

/** Board oscillator settings */
#define BOARD_FREQ_SLCK_XTAL        ( 32768U )
#define BOARD_FREQ_SLCK_BYPASS      ( 32768U )
#define BOARD_FREQ_MAINCK_XTAL      ( 12000000U )
#define BOARD_FREQ_MAINCK_BYPASS    ( 12000000U )

/** Master clock frequency */
#define BOARD_MCK                   CHIP_FREQ_CPU_MAX

/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_board_info "SAM3S-EK2 - Board informations"
 * This page lists several definition related to the board description.
 *
 * \section Definitions
 * - \ref BOARD_NAME
 */

/** Name of the board */
#define BOARD_NAME    "SAM3S-EK2"
/** Board definition */
#define sam3sek2
/** Family definition (already defined) */
#define sam3sd8
/** Core definition */
#define cortexm3

/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_piodef "SAM3S-EK - PIO definitions"
 * This pages lists all the pio definitions. The constants
 * are named using the following convention: PIN_* for a constant which defines
 * a single Pin instance (but may include several PIOs sharing the same
 * controller), and PINS_* for a list of Pin instances.
 *
 * ADC
 * - \ref PIN_ADC0_AD0
 * - \ref PIN_ADC0_AD1
 * - \ref PIN_ADC0_AD2
 * - \ref PIN_ADC0_AD3
 * - \ref PIN_ADC0_AD4
 * - \ref PIN_ADC0_AD5
 * - \ref PIN_ADC0_AD6
 * - \ref PIN_ADC0_AD7
 * - \ref PINS_ADC
 *
 * UART
 * - \ref PINS_UART
 *
 * EBI
 * - \ref PIN_EBI_DATA_BUS
 * - \ref PIN_EBI_NRD
 * - \ref PIN_EBI_NWE
 * - \ref PIN_EBI_NCS0
 * - \ref PIN_EBI_PSRAM_ADDR_BUS
 * - \ref PIN_EBI_PSRAM_NBS
 * - \ref PIN_EBI_A1
 * - \ref PIN_EBI_NCS1
 * - \ref PIN_EBI_LCD_RS
 *
 * LEDs
 * - \ref PIN_LED_0
 * - \ref PIN_LED_1
 * - \ref PIN_LED_2
 * - \ref PINS_LEDS
 *
 * HSMCI
 * - \ref PINS_HSMCI
 *
 * Push buttons
 * - \ref PIN_PUSHBUTTON_1
 * - \ref PIN_PUSHBUTTON_2
 * - \ref PINS_PUSHBUTTONS
 * - \ref PUSHBUTTON_BP1
 * - \ref PUSHBUTTON_BP2
 *
 * PWMC
 * - \ref PIN_PWMC_PWMH0
 * - \ref PIN_PWMC_PWML0
 * - \ref PIN_PWMC_PWMH1
 * - \ref PIN_PWMC_PWML1
 * - \ref PIN_PWMC_PWMH2
 * - \ref PIN_PWMC_PWML2
 * - \ref PIN_PWMC_PWMH3
 * - \ref PIN_PWMC_PWML3
 * - \ref PIN_PWM_LED0
 * - \ref PIN_PWM_LED1
 * - \ref PIN_PWM_LED2
 * - \ref CHANNEL_PWM_LED0
 * - \ref CHANNEL_PWM_LED1
 * - \ref CHANNEL_PWM_LED2
 *
 * SPI
 * - \ref PIN_SPI_MISO
 * - \ref PIN_SPI_MOSI
 * - \ref PIN_SPI_SPCK
 * - \ref PINS_SPI
 * - \ref PIN_SPI_NPCS0_PA11
 *
 * SSC
 * - \ref PIN_SSC_TD
 * - \ref PIN_SSC_TK
 * - \ref PIN_SSC_TF
 * - \ref PINS_SSC_CODEC
 *
 * PCK0
 * - \ref PIN_PCK0
 *
 * PIO PARALLEL CAPTURE
 * - \ref PIN_PIODCEN1
 * - \ref PIN_PIODCEN2
 *
 * TWI
 * - \ref TWI_V3XX
 * - \ref PIN_TWI_TWD0
 * - \ref PIN_TWI_TWCK0
 * - \ref PINS_TWI0
 * - \ref PIN_TWI_TWD1
 * - \ref PIN_TWI_TWCK1
 * - \ref PINS_TWI1
 *
 * USART0
 * - \ref PIN_USART0_RXD
 * - \ref PIN_USART0_TXD
 * - \ref PIN_USART0_CTS
 * - \ref PIN_USART0_RTS
 * - \ref PIN_USART0_SCK
 *
 * USB
 * - \ref PIN_USB_VBUS
 *
 * NandFlash
 * - \ref PIN_EBI_NANDOE
 * - \ref PIN_EBI_NANDWE
 * - \ref PIN_EBI_NANDCLE
 * - \ref PIN_EBI_NANDALE
 * - \ref PIN_EBI_NANDIO
 * - \ref BOARD_NF_CE_PIN
 * - \ref BOARD_NF_RB_PIN
 * - \ref PINS_NANDFLASH
 *
 * QTouch
 * PIO definitions for Slider
 * \ref SLIDER_IOMASK_SNS
 * \ref SLIDER_IOMASK_SNSK
 * \ref PINS_SLIDER_SNS
 * \ref PINS_SLIDER_SNSK
 *
 * PIO definitions for keys
 * \ref KEY_IOMASK_SNS
 * \ref KEY_IOMASK_SNSK
 * \ref PINS_KEY_SNS
 * \ref PINS_KEY_SNSK
 *
 * PIOS for QTouch
 * \ref PINS_QTOUCH
 */

/** ADC_AD0 pin definition. */
#define PIN_ADC0_AD0               { 1 << 21, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD1 pin definition. */
#define PIN_ADC0_AD1               { 1 << 30, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD2 pin definition. */
#define PIN_ADC0_AD2               { 1 << 3, PIOB, ID_PIOB, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD3 pin definition. */
#define PIN_ADC0_AD3               { 1 << 4, PIOB, ID_PIOB, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD4 pin definition. */
#define PIN_ADC0_AD4               { 1 << 15, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD5 pin definition. */
#define PIN_ADC0_AD5               { 1 << 16, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD6 pin definition. */
#define PIN_ADC0_AD6               { 1 << 17, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }
/** ADC_AD7 pin definition. */
#define PIN_ADC0_AD7               { 1 << 18, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }

/** Pins ADC */
#define PINS_ADC                   PIN_ADC0_AD0, PIN_ADC0_AD1, PIN_ADC0_AD2, PIN_ADC0_AD3, PIN_ADC0_AD4, PIN_ADC0_AD5, PIN_ADC0_AD6, PIN_ADC0_AD7
#define PINS_ADC_TRIG              PIO_PA8_IDX
#define PINS_ADC_TRIG_FLAG         ( PIO_PERIPH_B | PIO_DEFAULT )

/** Startup time max, return from Idle mode (in µs) */
#define ADC_STARTUP_TIME_MAX       15
/** Track and hold Acquisition Time min (in ns) */
#define ADC_TRACK_HOLD_TIME_MIN    1200
/** ADC clock frequency */
#define BOARD_ADC_FREQ             ( 6000000 )

/** UART pins (UTXD0 and URXD0) definitions, PA9,10. */
#define PINS_UART                  ( PIO_PA9A_URXD0 | PIO_PA10A_UTXD0 )
#define PINS_UART_FLAGS            ( PIO_PERIPH_A | PIO_DEFAULT )

#define PINS_UART_MASK             PIO_PA9A_URXD0 | PIO_PA10A_UTXD0
#define PINS_UART_PIO              PIOA
#define PINS_UART_ID               ID_PIOA
#define PINS_UART_TYPE             PIO_PERIPH_A
#define PINS_UART_ATTR             PIO_DEFAULT

/** EBI Data Bus pins */
#define PIN_EBI_DATA_BUS_D0        PIO_PC0_IDX
#define PIN_EBI_DATA_BUS_D1        PIO_PC1_IDX
#define PIN_EBI_DATA_BUS_D2        PIO_PC2_IDX
#define PIN_EBI_DATA_BUS_D3        PIO_PC3_IDX
#define PIN_EBI_DATA_BUS_D4        PIO_PC4_IDX
#define PIN_EBI_DATA_BUS_D5        PIO_PC5_IDX
#define PIN_EBI_DATA_BUS_D6        PIO_PC6_IDX
#define PIN_EBI_DATA_BUS_D7        PIO_PC7_IDX
#define PIN_EBI_DATA_BUS_FLAGS     PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_DATA_BUS_MASK      0xFF
#define PIN_EBI_DATA_BUS_PIO       PIOC
#define PIN_EBI_DATA_BUS_ID        ID_PIOC
#define PIN_EBI_DATA_BUS_TYPE      PIO_PERIPH_A
#define PIN_EBI_DATA_BUS_ATTR      PIO_PULLUP
/** EBI NRD pin */
#define PIN_EBI_NRD                PIO_PC11_IDX
#define PIN_EBI_NRD_FLAGS          PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NRD_MASK           1 << 11
#define PIN_EBI_NRD_PIO            PIOC
#define PIN_EBI_NRD_ID             ID_PIOC
#define PIN_EBI_NRD_TYPE           PIO_PERIPH_A
#define PIN_EBI_NRD_ATTR           PIO_PULLUP
/** EBI NWE pin */
#define PIN_EBI_NWE                PIO_PC8_IDX
#define PIN_EBI_NWE_FLAGS          PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NWE_MASK           1 << 8
#define PIN_EBI_NWE_PIO            PIOC
#define PIN_EBI_NWE_ID             ID_PIOC
#define PIN_EBI_NWE_TYPE           PIO_PERIPH_A
#define PIN_EBI_NWE_ATTR           PIO_PULLUP
/** EBI NCS0 pin */
#define PIN_EBI_NCS0               PIO_PC14_IDX
#define PIN_EBI_NCS0_FLAGS         PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NCS0_MASK          1 << 14
#define PIN_EBI_NCS0_PIO           PIOC
#define PIN_EBI_NCS0_ID            ID_PIOC
#define PIN_EBI_NCS0_TYPE          PIO_PERIPH_A
#define PIN_EBI_NCS0_ATTR          PIO_PULLUP
/** EBI address bus pins  */
#define PIN_EBI_ADDR_BUS_A0        PIO_PC18_IDX
#define PIN_EBI_ADDR_BUS_A1        PIO_PC19_IDX
#define PIN_EBI_ADDR_BUS_A2        PIO_PC20_IDX
#define PIN_EBI_ADDR_BUS_A3        PIO_PC21_IDX
#define PIN_EBI_ADDR_BUS_A4        PIO_PC22_IDX
#define PIN_EBI_ADDR_BUS_A5        PIO_PC23_IDX
#define PIN_EBI_ADDR_BUS_A6        PIO_PC24_IDX
#define PIN_EBI_ADDR_BUS_A7        PIO_PC25_IDX
#define PIN_EBI_ADDR_BUS_A8        PIO_PC26_IDX
#define PIN_EBI_ADDR_BUS_A9        PIO_PC27_IDX
#define PIN_EBI_ADDR_BUS_A10       PIO_PC28_IDX
#define PIN_EBI_ADDR_BUS_A11       PIO_PC29_IDX
#define PIN_EBI_ADDR_BUS_A12       PIO_PC30_IDX
#define PIN_EBI_ADDR_BUS_A13       PIO_PC31_IDX
#define PIN_EBI_ADDR_BUS_FLAG1     PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_ADDR_BUS_A14       PIO_PA18_IDX
#define PIN_EBI_ADDR_BUS_A15       PIO_PA19_IDX
#define PIN_EBI_ADDR_BUS_A16       PIO_PA20_IDX
#define PIN_EBI_ADDR_BUS_A17       PIO_PA0_IDX
#define PIN_EBI_ADDR_BUS_A18       PIO_PA1_IDX
#define PIN_EBI_ADDR_BUS_A19       PIO_PA23_IDX
#define PIN_EBI_ADDR_BUS_A20       PIO_PA24_IDX
#define PIN_EBI_ADDR_BUS_FLAG2     PIO_PERIPH_C | PIO_PULLUP
/** EBI pin for LCD CS */
#define PIN_EBI_NCS1               PIO_PC15_IDX
#define PIN_EBI_NCS1_FLAGS         PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NCS1_MASK          1 << 15
#define PIN_EBI_NCS1_PIO           PIOC
#define PIN_EBI_NCS1_ID            ID_PIOC
#define PIN_EBI_NCS1_TYPE          PIO_PERIPH_A
#define PIN_EBI_NCS1_ATTR          PIO_PULLUP
/** EBI pin for LCD RS */
#define PIN_EBI_LCD_RS             PIO_PC19_IDX
#define PIN_EBI_LCD_RS_FLAGS       PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_LCD_RS_MASK        1 << 19
#define PIN_EBI_LCD_RS_PIO         PIOC
#define PIN_EBI_LCD_RS_ID          ID_PIOC
#define PIN_EBI_LCD_RS_TYPE        PIO_PERIPH_A
#define PIN_EBI_LCD_RS_ATTR        PIO_PULLUP

#define LED_BLUE                   0
#define LED_GREEN                  1
#define LED_RED                    2

#ifdef BOARD_REV_A
/** LED #0 pin definition (BLUE). */
    #define LED_0_NAME        "blue LED D2"
    #define LED0_GPIO         ( PIO_PC20_IDX )
    #define LED0_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_0         { PIO_PC20, PIOC, ID_PIOC, PIO_OUTPUT_1, PIO_DEFAULT }
    #define PIN_LED_0_MASK    PIO_PC20
    #define PIN_LED_0_PIO     PIOC
    #define PIN_LED_0_ID      ID_PIOC
    #define PIN_LED_0_TYPE    PIO_OUTPUT_1
    #define PIN_LED_0_ATTR    PIO_DEFAULT

