FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3S-EK2_Atmel_Studio/src/asf/sam/boards/sam3s_ek2/sam3s_ek2.h
/** LED #1 pin definition (GREEN). */
    #define LED_1_NAME        "green LED D3"
    #define LED1_GPIO         ( PIO_PC21_IDX )
    #define LED1_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_1         { PIO_PC21, PIOC, ID_PIOC, PIO_OUTPUT_1, PIO_DEFAULT }
/** LED #2 pin definition (RED). */
    #define LED2_GPIO         ( PIO_PC22_IDX )
    #define LED2_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_2         { PIO_PC22, PIOC, ID_PIOC, PIO_OUTPUT_1, PIO_DEFAULT }
#endif /* ifdef BOARD_REV_A */

#ifdef BOARD_REV_B
/** LED #0 pin definition (BLUE). */
    #define LED_0_NAME        "blue LED D2"
    #define LED0_GPIO         ( PIO_PA19_IDX )
    #define LED0_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_0         { PIO_PA19, PIOA, ID_PIOA, PIO_OUTPUT_1, PIO_DEFAULT }
    #define PIN_LED_0_MASK    PIO_PA19
    #define PIN_LED_0_PIO     PIOA
    #define PIN_LED_0_ID      ID_PIOA
    #define PIN_LED_0_TYPE    PIO_OUTPUT_1
    #define PIN_LED_0_ATTR    PIO_DEFAULT

/** LED #1 pin definition (GREEN). */
    #define LED_1_NAME        "green LED D3"
    #define LED1_GPIO         ( PIO_PA20_IDX )
    #define LED1_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_1         { PIO_PA20, PIOA, ID_PIOA, PIO_OUTPUT_1, PIO_DEFAULT }
    #define PIN_LED_1_MASK    PIO_PA20
    #define PIN_LED_1_PIO     PIOA
    #define PIN_LED_1_ID      ID_PIOA
    #define PIN_LED_1_TYPE    PIO_OUTPUT_1
    #define PIN_LED_1_ATTR    PIO_DEFAULT

/** LED #2 pin definition (RED). */
    #define LED2_GPIO         ( PIO_PC20_IDX )
    #define LED2_FLAGS        ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

    #define PIN_LED_2         { PIO_PC20, PIOC, ID_PIOC, PIO_OUTPUT_1, PIO_DEFAULT }

#endif /* ifdef BOARD_REV_B */

/** List of all LEDs definitions. */
#define PINS_LEDS           PIN_LED_0, PIN_LED_1, PIN_LED_2

/** HSMCI pins definition. */
#define PINS_HSMCI          { 0x3fUL << 26, PIOA, ID_PIOA, PIO_PERIPH_C, PIO_PULLUP }
/** HSMCI pin Card Detect. */
#ifdef BOARD_REV_A
    #define PIN_HSMCI_CD    { PIO_PA15, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
#endif

#ifdef BOARD_REV_B
    #define PIN_HSMCI_CD    { PIO_PA6, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
#endif

/** Push button #0 definition. Attributes = pull-up + debounce + interrupt on rising edge. */
#define PUSHBUTTON_1_NAME           "USRPB1"
#define GPIO_PUSH_BUTTON_1          ( PIO_PB3_IDX )
#define GPIO_PUSH_BUTTON_1_FLAGS    ( PIO_INPUT | PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_RISE_EDGE )

#define PIN_PUSHBUTTON_1            { PIO_PB3, PIOB, ID_PIOB, PIO_INPUT, PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_RISE_EDGE }
#define PIN_PUSHBUTTON_1_MASK       PIO_PB3
#define PIN_PUSHBUTTON_1_PIO        PIOB
#define PIN_PUSHBUTTON_1_ID         ID_PIOB
#define PIN_PUSHBUTTON_1_TYPE       PIO_INPUT
#define PIN_PUSHBUTTON_1_ATTR       PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_RISE_EDGE

/** Push button #1 definition. Attributes = pull-up + debounce + interrupt on falling edge. */
#define PUSHBUTTON_2_NAME           "USRPB2"
#define GPIO_PUSH_BUTTON_2          ( PIO_PC12_IDX )
#define GPIO_PUSH_BUTTON_2_FLAGS    ( PIO_INPUT | PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE )

#define PIN_PUSHBUTTON_2            { PIO_PC12, PIOC, ID_PIOC, PIO_INPUT, PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE }
#define PIN_PUSHBUTTON_2_MASK       PIO_PC12
#define PIN_PUSHBUTTON_2_PIO        PIOC
#define PIN_PUSHBUTTON_2_ID         ID_PIOC
#define PIN_PUSHBUTTON_2_TYPE       PIO_INPUT
#define PIN_PUSHBUTTON_2_ATTR       PIO_PULLUP | PIO_DEBOUNCE | PIO_IT_FALL_EDGE

/** List of all push button definitions. */
#define PINS_PUSHBUTTONS            PIN_PUSHBUTTON_1, PIN_PUSHBUTTON_2

/** Push button #1 index. */
#define PUSHBUTTON_BP1              0
/** Push button #2 index. */
#define PUSHBUTTON_BP2              1

#define PIN_TC0_TIOA0               ( PIO_PA0_IDX )
#define PIN_TC0_TIOA0_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )

#define PIN_TC0_TIOA1               ( PIO_PA15_IDX )
#define PIN_TC0_TIOA1_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )

#define PIN_TC0_TIOA1_PIO           PIOA
#define PIN_TC0_TIOA1_MASK          PIO_PA15
#define PIN_TC0_TIOA1_ID            ID_PIOA
#define PIN_TC0_TIOA1_TYPE          PIO_PERIPH_B
#define PIN_TC0_TIOA1_ATTR          PIO_DEFAULT

#define PIN_TC0_TIOA2               ( PIO_PA26_IDX )
#define PIN_TC0_TIOA2_FLAGS         ( PIO_INPUT | PIO_DEFAULT )

#define PIN_TC0_TIOA2_PIO           PIOA
#define PIN_TC0_TIOA2_MASK          PIO_PA26
#define PIN_TC0_TIOA2_ID            ID_PIOA
#define PIN_TC0_TIOA2_TYPE          PIO_INPUT
#define PIN_TC0_TIOA2_ATTR          PIO_DEFAULT

/** PWMC PWM0 pin definition: Output High. */
#define PIN_PWMC_PWMH0              { PIO_PC18B_PWMH0, PIOC, ID_PIOC, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_PWMC_PWMH0_TRIG         PIO_PC18_IDX
#define PIN_PWMC_PWMH0_TRIG_FLAG    PIO_PERIPH_B | PIO_DEFAULT
/** PWMC PWM0 pin definition: Output Low. */
#define PIN_PWMC_PWML0              { PIO_PA19B_PWML0, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/** PWMC PWM1 pin definition: Output High. */
#define PIN_PWMC_PWMH1              { PIO_PC19B_PWMH1, PIOC, ID_PIOC, PIO_PERIPH_B, PIO_DEFAULT }
/** PWMC PWM1 pin definition: Output Low. */
#define PIN_PWMC_PWML1              { PIO_PA20B_PWML1, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
/** PWMC PWM2 pin definition: Output High. */
#define PIN_PWMC_PWMH2              { PIO_PC20B_PWMH2, PIOC, ID_PIOC, PIO_PERIPH_B, PIO_DEFAULT }
/** PWMC PWM2 pin definition: Output Low. */
#define PIN_PWMC_PWML2              { PIO_PA16C_PWML2, PIOA, ID_PIOA, PIO_PERIPH_C, PIO_DEFAULT }
/** PWMC PWM3 pin definition: Output High. */
#define PIN_PWMC_PWMH3              { PIO_PC21B_PWMH3, PIOC, ID_PIOC, PIO_PERIPH_B, PIO_DEFAULT }
/** PWMC PWM3 pin definition: Output Low. */
#define PIN_PWMC_PWML3              { PIO_PA15C_PWML3, PIOA, ID_PIOA, PIO_PERIPH_C, PIO_DEFAULT }
/** PWM pins definition for LED0 */
#define PIN_PWM_LED0                PIN_PWMC_PWMH0, PIN_PWMC_PWML0
/** PWM pins definition for LED1 */
#define PIN_PWM_LED1                PIN_PWMC_PWMH1, PIN_PWMC_PWML1
/** PWM pins definition for LED2 */
#define PIN_PWM_LED2                PIN_PWMC_PWMH2, PIN_PWMC_PWML2
/** PWM channel for LED0 */
#define CHANNEL_PWM_LED0            0
/** PWM channel for LED1 */
#define CHANNEL_PWM_LED1            1
/** PWM channel for LED2 */
#define CHANNEL_PWM_LED2            2

