FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3S-EK2_Atmel_Studio/src/asf/sam/boards/sam3s_ek2/sam3s_ek2.h
/** PWM LED0 pin definitions. */
#define PIN_PWM_LED0_GPIO           PIO_PA19_IDX
#define PIN_PWM_LED0_FLAGS          ( PIO_PERIPH_B | PIO_DEFAULT )
#define PIN_PWM_LED0_CHANNEL        PWM_CHANNEL_0

/** PWM LED1 pin definitions. */
#define PIN_PWM_LED1_GPIO           PIO_PA20_IDX
#define PIN_PWM_LED1_FLAGS          ( PIO_PERIPH_B | PIO_DEFAULT )
#define PIN_PWM_LED1_CHANNEL        PWM_CHANNEL_1

/** PWM LED2 pin definitions. */
#define PIN_PWM_LED2_GPIO           PIO_PC20_IDX
#define PIN_PWM_LED2_FLAGS          ( PIO_PERIPH_B | PIO_DEFAULT )

/** SPI MISO pin definition. */
#define PIN_SPI_MISO                { PIO_PA12A_MISO, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SPI MOSI pin definition. */
#define PIN_SPI_MOSI                { PIO_PA13A_MOSI, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SPI SPCK pin definition. */
#define PIN_SPI_SPCK                { PIO_PA14A_SPCK, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SPI chip select pin definition. */
#define PIN_SPI_NPCS0_PA11          { PIO_PA11A_NPCS0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** List of SPI pin definitions (MISO, MOSI & SPCK). */
#define PINS_SPI                    PIN_SPI_MISO, PIN_SPI_MOSI, PIN_SPI_SPCK
/** SPI MISO pin definition. */
#define SPI_MISO_GPIO               ( PIO_PA12_IDX )
#define SPI_MISO_FLAGS              ( PIO_PERIPH_A | PIO_DEFAULT )
/** SPI MOSI pin definition. */
#define SPI_MOSI_GPIO               ( PIO_PA13_IDX )
#define SPI_MOSI_FLAGS              ( PIO_PERIPH_A | PIO_DEFAULT )
/** SPI SPCK pin definition. */
#define SPI_SPCK_GPIO               ( PIO_PA14_IDX )
#define SPI_SPCK_FLAGS              ( PIO_PERIPH_A | PIO_DEFAULT )

/** SPI chip select 0 pin definition. (Only one configuration is possible) */
#define SPI_NPCS0_GPIO              ( PIO_PA11_IDX )
#define SPI_NPCS0_FLAGS             ( PIO_PERIPH_A | PIO_DEFAULT )
/** SPI chip select 1 pin definition. (multiple configurations are possible) */
#define SPI_NPCS1_PA9_GPIO          ( PIO_PA9_IDX )
#define SPI_NPCS1_PA9_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )
#define SPI_NPCS1_PA31_GPIO         ( PIO_PA31_IDX )
#define SPI_NPCS1_PA31_FLAGS        ( PIO_PERIPH_A | PIO_DEFAULT )
#define SPI_NPCS1_PB14_GPIO         ( PIO_PB14_IDX )
#define SPI_NPCS1_PB14_FLAGS        ( PIO_PERIPH_A | PIO_DEFAULT )
#define SPI_NPCS1_PC4_GPIO          ( PIO_PC4_IDX )
#define SPI_NPCS1_PC4_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )
/** SPI chip select 2 pin definition. (multiple configurations are possible) */
#define SPI_NPCS2_PA10_GPIO         ( PIO_PA10_IDX )
#define SPI_NPCS2_PA10_FLAGS        ( PIO_PERIPH_B | PIO_DEFAULT )
#define SPI_NPCS2_PA30_GPIO         ( PIO_PA30_IDX )
#define SPI_NPCS2_PA30_FLAGS        ( PIO_PERIPH_B | PIO_DEFAULT )
#define SPI_NPCS2_PB2_GPIO          ( PIO_PB2_IDX )
#define SPI_NPCS2_PB2_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )
/** SPI chip select 3 pin definition. (multiple configurations are possible) */
#define SPI_NPCS3_PA3_GPIO          ( PIO_PA3_IDX )
#define SPI_NPCS3_PA3_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )
#define SPI_NPCS3_PA5_GPIO          ( PIO_PA5_IDX )
#define SPI_NPCS3_PA5_FLAGS         ( PIO_PERIPH_B | PIO_DEFAULT )
#define SPI_NPCS3_PA22_GPIO         ( PIO_PA22_IDX )
#define SPI_NPCS3_PA22_FLAGS        ( PIO_PERIPH_B | PIO_DEFAULT )

/** SSC pin Transmitter Data (TD) */
#define PIN_SSC_TD                  { PIO_PA17A_TD, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SSC pin Transmitter Clock (TK) */
#define PIN_SSC_TK                  { PIO_PA16A_TK, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SSC pin Transmitter FrameSync (TF) */
#define PIN_SSC_TF                  { PIO_PA15A_TF, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** SSC pins definition for codec. */
#define PINS_SSC_CODEC              PIN_SSC_TD, PIN_SSC_TK, PIN_SSC_TF

/** PCK0 */
#define PIN_PCK0                    ( PIO_PA6_IDX )
#define PIN_PCK0_FLAGS              ( PIO_PERIPH_B | PIO_DEFAULT )

#define PIN_PCK_0_MASK              PIO_PA6
#define PIN_PCK_0_PIO               PIOA
#define PIN_PCK_0_ID                ID_PIOA
#define PIN_PCK_0_TYPE              PIO_PERIPH_B
#define PIN_PCK_0_ATTR              PIO_DEFAULT
#define PIN_PCK1                    { PIO_PA17B_PCK1, PIOA, ID_PIOA, PIO_PERIPH_B, PIO_DEFAULT }
#define PIN_PCK_1_MASK              PIO_PA17
#define PIN_PCK_1_PIO               PIOA
#define PIN_PCK_1_ID                ID_PIOA
#define PIN_PCK_1_TYPE              PIO_PERIPH_B
#define PIN_PCK_1_ATTR              PIO_DEFAULT

/** PIO PARALLEL CAPTURE */
/** Parallel Capture Mode Data Enable1 */
#define PIN_PIODCEN1    PIO_PA15
/** Parallel Capture Mode Data Enable2 */
#define PIN_PIODCEN2    PIO_PA16

/** TWI ver 3.xx */
#define TWI_V3XX
/** TWI0 data pin */
#define PIN_TWI_TWD0            { PIO_PA3A_TWD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** TWI0 clock pin */
#define PIN_TWI_TWCK0           { PIO_PA4A_TWCK0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
/** TWI0 pins */
#define PINS_TWI0               PIN_TWI_TWD0, PIN_TWI_TWCK0
/** TWI1 data pin */
#define PIN_TWI_TWD1            { PIO_PB4A_TWD1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/** TWI1 clock pin */
#define PIN_TWI_TWCK1           { PIO_PB5A_TWCK1, PIOB, ID_PIOB, PIO_PERIPH_A, PIO_DEFAULT }
/** TWI1 pins */
#define PINS_TWI1               PIN_TWI_TWD1, PIN_TWI_TWCK1

/** USART0 pin RX */
#define PIN_USART0_RXD          { PIO_PA5A_RXD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_RXD_IDX      ( PIO_PA5_IDX )
#define PIN_USART0_RXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART0 pin TX */
#define PIN_USART0_TXD          { PIO_PA6A_TXD0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_TXD_IDX      ( PIO_PA6_IDX )
#define PIN_USART0_TXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART0 pin CTS */
#define PIN_USART0_CTS          { PIO_PA8A_CTS0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_CTS_IDX      ( PIO_PA8_IDX )
#define PIN_USART0_CTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART0 pin RTS */
#define PIN_USART0_RTS          { PIO_PA7A_RTS0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_RTS_IDX      ( PIO_PA7_IDX )
#define PIN_USART0_RTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART0 pin SCK */
#define PIN_USART0_SCK          { PIO_PA2B_SCK0, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART0_SCK_IDX      ( PIO_PA2_IDX )
#define PIN_USART0_SCK_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )

/** USART1 pin RX */
#define PIN_USART1_RXD          { PIO_PA21A_RXD1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_RXD_IDX      ( PIO_PA21_IDX )
#define PIN_USART1_RXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART1 pin TX */
#define PIN_USART1_TXD          { PIO_PA22A_TXD1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_TXD_IDX      ( PIO_PA22_IDX )
#define PIN_USART1_TXD_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART1 pin CTS */
#define PIN_USART1_CTS          { PIO_PA25A_CTS1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_CTS_IDX      ( PIO_PA25_IDX )
#define PIN_USART1_CTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART1 pin RTS */
#define PIN_USART1_RTS          { PIO_PA24A_RTS1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_RTS_IDX      ( PIO_PA24_IDX )
#define PIN_USART1_RTS_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )
/** USART1 pin ENABLE */
#define PIN_USART1_EN           { PIO_PA23A_SCK1, PIOA, ID_PIOA, PIO_OUTPUT_0, PIO_DEFAULT }
#define PIN_USART1_EN_IDX       ( PIO_PA23_IDX )
#define PIN_USART1_EN_FLAGS     ( PIO_OUTPUT_0 | PIO_DEFAULT )
/** USART1 pin SCK */
#define PIN_USART1_SCK          { PIO_PA23A_SCK1, PIOA, ID_PIOA, PIO_PERIPH_A, PIO_DEFAULT }
#define PIN_USART1_SCK_IDX      ( PIO_PA23_IDX )
#define PIN_USART1_SCK_FLAGS    ( PIO_PERIPH_A | PIO_DEFAULT )

/** USB VBus monitoring pin definition. */
#ifdef BOARD_REV_A
    #define PIN_USB_VBUS    { PIO_PC23, PIOC, ID_PIOC, PIO_INPUT, PIO_PULLUP }
#endif

#ifdef BOARD_REV_B
    #define PIN_USB_VBUS    { PIO_PC21, PIOC, ID_PIOC, PIO_INPUT, PIO_PULLUP }
#endif

/** NandFlash pins definition: OE. */
#define PIN_EBI_NANDOE            ( PIO_PC9_IDX )
#define PIN_EBI_NANDOE_FLAGS      ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: WE. */
#define PIN_EBI_NANDWE            ( PIO_PC10_IDX )
#define PIN_EBI_NANDWE_FLAGS      ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: CLE. */
#define PIN_EBI_NANDCLE           ( PIO_PC17_IDX )
#define PIN_EBI_NANDCLE_FLAGS     ( PIO_PERIPH_A | PIO_PULLUP )

/** NandFlash pins definition: ALE. */
#define PIN_EBI_NANDALE           ( PIO_PC16_IDX )
#define PIN_EBI_NANDALE_FLAGS     ( PIO_PERIPH_A | PIO_PULLUP )

