FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3S-EK2_Atmel_Studio/src/asf/sam/boards/sam3s_ek2/sam3s_ek2.h
/** NandFlash pins definition: DATA. */
#define PIN_EBI_NANDIO_0          ( PIO_PC0_IDX )
#define PIN_EBI_NANDIO_0_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_1          ( PIO_PC1_IDX )
#define PIN_EBI_NANDIO_1_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_2          ( PIO_PC2_IDX )
#define PIN_EBI_NANDIO_2_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_3          ( PIO_PC3_IDX )
#define PIN_EBI_NANDIO_3_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_4          ( PIO_PC4_IDX )
#define PIN_EBI_NANDIO_4_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_5          ( PIO_PC5_IDX )
#define PIN_EBI_NANDIO_5_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_6          ( PIO_PC6_IDX )
#define PIN_EBI_NANDIO_6_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

#define PIN_EBI_NANDIO_7          ( PIO_PC7_IDX )
#define PIN_EBI_NANDIO_7_FLAGS    ( PIO_PERIPH_A | PIO_PULLUP )

/** Nandflash chip enable pin definition. */
#define PIN_NF_CE_IDX             ( PIO_PC14_IDX )
#define PIN_NF_CE_FLAGS           ( PIO_TYPE_PIO_OUTPUT_1 | PIO_DEFAULT )

/** Nandflash ready/busy pin definition. */
#define PIN_NF_RB_IDX             ( PIO_PC18_IDX )
#define PIN_NF_RB_FLAGS           ( PIO_INPUT | PIO_PULLUP )

/* Chip select number for nand */
#define BOARD_NAND_CS             0

/* PIO definitions for Slider */
#define SLIDER_IOMASK_SNS         ( uint32_t ) ( PIO_PA0 | PIO_PA2 | PIO_PA4 )
#define SLIDER_IOMASK_SNSK        ( uint32_t ) ( PIO_PA1 | PIO_PA3 | PIO_PA5 )
#define PINS_SLIDER_SNS           { SLIDER_IOMASK_SNS, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT }
#define PINS_SLIDER_SNSK          { SLIDER_IOMASK_SNSK, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT }

/* PIO definitions for keys */
#define KEY_IOMASK_SNS            ( uint32_t ) ( PIO_PC22 | PIO_PC24 | PIO_PC26 | PIO_PC28 | PIO_PC30 )
#define KEY_IOMASK_SNSK           ( uint32_t ) ( PIO_PC23 | PIO_PC25 | PIO_PC27 | PIO_PC29 | PIO_PC31 )
#define PINS_KEY_SNS              { KEY_IOMASK_SNS, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }
#define PINS_KEY_SNSK             { KEY_IOMASK_SNSK, PIOC, ID_PIOC, PIO_INPUT, PIO_DEFAULT }

/* PIOS for QTouch */
#define PINS_QTOUCH               PINS_SLIDER_SNS, PINS_SLIDER_SNSK, PINS_KEY_SNS, PINS_KEY_SNSK


/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_usb "SAM3S-EK - USB device"
 *
 * \section Definitions
 * - \ref BOARD_USB_BMATTRIBUTES
 * - \ref CHIP_USB_UDP
 * - \ref CHIP_USB_PULLUP_INTERNAL
 * - \ref CHIP_USB_NUMENDPOINTS
 * - \ref CHIP_USB_ENDPOINTS_MAXPACKETSIZE
 * - \ref CHIP_USB_ENDPOINTS_BANKS
 */

/** USB attributes configuration descriptor (bus or self powered, remote wakeup) */
#define BOARD_USB_BMATTRIBUTES    USBConfigurationDescriptor_SELFPOWERED_RWAKEUP

/** Indicates chip has an UDP Full Speed. */
#define CHIP_USB_UDP

/** Indicates chip has an internal pull-up. */
#define CHIP_USB_PULLUP_INTERNAL

/** Number of USB endpoints */
#define CHIP_USB_NUMENDPOINTS    8

/** Endpoints max packet size */
#define CHIP_USB_ENDPOINTS_MAXPACKETSIZE( i ) \
    ( ( i == 0 ) ? 64 :                       \
      ( ( i == 1 ) ? 64 :                     \
        ( ( i == 2 ) ? 64 :                   \
          ( ( i == 3 ) ? 64 :                 \
            ( ( i == 4 ) ? 512 :              \
              ( ( i == 5 ) ? 512 :            \
                ( ( i == 6 ) ? 64 :           \
                  ( ( i == 7 ) ? 64 : 0 ) ) ) ) ) ) ) )

/** Endpoints Number of Bank */
#define CHIP_USB_ENDPOINTS_BANKS( i ) \
    ( ( i == 0 ) ? 1 :                \
      ( ( i == 1 ) ? 2 :              \
        ( ( i == 2 ) ? 2 :            \
          ( ( i == 3 ) ? 1 :          \
            ( ( i == 4 ) ? 2 :        \
              ( ( i == 5 ) ? 2 :      \
                ( ( i == 6 ) ? 2 :    \
                  ( ( i == 7 ) ? 2 : 0 ) ) ) ) ) ) ) )

/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_extcomp "SAM3S-EK - External components"
 * This page lists the definitions related to external on-board components
 * located in the board.h file for the SAM3S-EK.
 *
 * SD Card
 * - \ref BOARD_SD_PINS
 * - \ref BOARD_SD_PIN_CD
 *
 * LCD
 * - \ref BOARD_LCD_ILI9325
 * - \ref BOARD_LCD_PINS
 * - \ref BOARD_BACKLIGHT_PIN
 * - \ref BOARD_LCD_BASE
 * - \ref BOARD_LCD_RS
 *
 * TouchScreen
 * - \ref BOARD_TSC_ADS7843
 * - \ref PIN_TCS_IRQ
 * - \ref PIN_TCS_BUSY
 * - \ref BOARD_TSC_SPI_BASE
 * - \ref BOARD_TSC_SPI_ID
 * - \ref BOARD_TSC_SPI_PINS
 * - \ref BOARD_TSC_NPCS
 * - \ref BOARD_TSC_NPCS_PIN
 *
 * SmartCard
 * - \ref SMARTCARD_CONNECT_PIN
 * - \ref PIN_ISO7816_RSTMC
 * - \ref PINS_ISO7816
 */

/** HSMCI pins that shall be configured to access the SD card. */
#define BOARD_SD_PINS      PINS_HSMCI
/** HSMCI Card Detect pin. */
#define BOARD_SD_PIN_CD    PIN_HSMCI_CD

/** Indicates board has an ILI9325 external component to manage LCD. */
#define BOARD_LCD_ILI9325

/** Backlight pin definition. */
#define BOARD_BACKLIGHT             PIO_PC13_IDX
#define BOARD_BACKLIGHT_FLAG        PIO_OUTPUT_0 | PIO_DEFAULT
#define BOARD_BACKLIGHT_PIN         { PIO_PC13, PIOC, ID_PIOC, PIO_OUTPUT_0, PIO_DEFAULT }
#define PIN_BOARD_BACKLIGHT_MASK    PIO_PC13
#define PIN_BOARD_BACKLIGHT_PIO     PIOC
#define PIN_BOARD_BACKLIGHT_ID      ID_PIOC
#define PIN_BOARD_BACKLIGHT_TYPE    PIO_OUTPUT_0
#define PIN_BOARD_BACKLIGHT_ATTR    PIO_PULLUP
/** Define ILI9325 base address. */
#define BOARD_LCD_BASE              0x61000000
/** Define ILI9325 register select signal. */
#define BOARD_LCD_RS                ( 1 << 1 )

/** Indicates board has an ADS7843 external component to manage Touch Screen */
#define BOARD_TSC_ADS7843

/** Definition of MMA7341L x,y,z axis channel number */
#define MMA7341L_ADC_CHANNEL_X      2
#define MMA7341L_ADC_CHANNEL_Y      6
#define MMA7341L_ADC_CHANNEL_Z      7

/** MMA7341L mode set pin definition. */
#define PIN_MMA7341L_MODE           PIO_PC13_IDX
#define PIN_MMA7341L_MODE_FLAG      PIO_OUTPUT_1 | PIO_DEFAULT

/** MMA7341L X,Y,Z axis pin definition. */
#define PIN_MMA7341L_X_AXIS         PIO_PB3_IDX
#define PIN_MMA7341L_X_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT
#define PIN_MMA7341L_Y_AXIS         PIO_PC17_IDX
#define PIN_MMA7341L_Y_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT
#define PIN_MMA7341L_Z_AXIS         PIO_PC18_IDX
#define PIN_MMA7341L_Z_AXIS_FLAG    PIO_INPUT | PIO_DEFAULT

/** Touchscreen controller IRQ pin definition. */
#ifdef BOARD_REV_A
    #define PIN_TSC_IRQ_IDX       PIO_PA4_IDX
    #define PIN_TSC_IRQ_FLAG      PIO_INPUT | PIO_PULLUP
    #define PIN_TSC_IRQ           { PIO_PA4, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
    #define PIN_TSC_IRQ_MASK      PIO_PA4
    #define PIN_TSC_IRQ_PIO       PIOA
    #define PIN_TSC_IRQ_ID        ID_PIOA
    #define PIN_TSC_IRQ_TYPE      PIO_INPUT
    #define PIN_TSC_IRQ_ATTR      PIO_PULLUP
    #define PIN_TSC_IRQ_WUP_ID    ( 1 << 3 )
/** Touchscreen controller Busy pin definition. */
    #define PIN_TSC_BUSY_IDX      PIO_PA5_IDX
    #define PIN_TSC_BUSY_FLAG     PIO_INPUT | PIO_PULLUP
    #define PIN_TSC_BUSY          { PIO_PA5, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
    #define PIN_TSC_BUSY_MASK     PIO_PA5
    #define PIN_TSC_BUSY_PIO      PIOA
    #define PIN_TSC_BUSY_ID       ID_PIOA
    #define PIN_TSC_BUSY_TYPE     PIO_INPUT
    #define PIN_TSC_BUSY_ATTR     PIO_PULLUP
#endif /* ifdef BOARD_REV_A */

#ifdef BOARD_REV_B
    #define PIN_TSC_IRQ_IDX       PIO_PA16_IDX
    #define PIN_TSC_IRQ_FLAG      PIO_INPUT | PIO_PULLUP
    #define PIN_TSC_IRQ           { PIO_PA16, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
    #define PIN_TSC_IRQ_MASK      PIO_PA16
    #define PIN_TSC_IRQ_PIO       PIOA
    #define PIN_TSC_IRQ_ID        ID_PIOA
    #define PIN_TSC_IRQ_TYPE      PIO_INPUT
    #define PIN_TSC_IRQ_ATTR      PIO_PULLUP
    #define PIN_TSC_IRQ_WUP_ID    ( 1 << 15 )
/** Touchscreen controller Busy pin definition. */
    #define PIN_TSC_BUSY_IDX      PIO_PA17_IDX
    #define PIN_TSC_BUSY_FLAG     PIO_INPUT | PIO_PULLUP
    #define PIN_TSC_BUSY          { PIO_PA17, PIOA, ID_PIOA, PIO_INPUT, PIO_PULLUP }
    #define PIN_TSC_BUSY_MASK     PIO_PA17
    #define PIN_TSC_BUSY_PIO      PIOA
    #define PIN_TSC_BUSY_ID       ID_PIOA
    #define PIN_TSC_BUSY_TYPE     PIO_INPUT
    #define PIN_TSC_BUSY_ATTR     PIO_PULLUP
#endif /* ifdef BOARD_REV_B */

/** Base address of SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_BASE    SPI
/** Identifier of SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_ID      ID_SPI
/** Pins of the SPI peripheral connected to the touchscreen controller. */
#define BOARD_TSC_SPI_PINS    PINS_SPI
/** Chip select connected to the touchscreen controller. */
#define BOARD_TSC_NPCS        0
/** Chip select pin connected to the touchscreen controller. */
#define BOARD_TSC_NPCS_PIN    PIN_SPI_NPCS0_PA11

/*/ Smartcard detection pin */
/*#define SMARTCARD_CONNECT_PIN {1 << 13, PIOA, ID_PIOA, PIO_INPUT, PIO_DEFAULT} */

