FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_ATSAM3S-EK2_Atmel_Studio/src/asf/sam/boards/sam3s_ek2/sam3s_ek2.h
/*/ PIN used for reset the smartcard */
#define PIN_ISO7816_RSTMC    { 1 << 11, PIOA, ID_PIOA, PIO_OUTPUT_0, PIO_DEFAULT }
/*/ Pins used for connect the smartcard */
#define PINS_ISO7816         PIN_USART1_TXD, PIN_USART1_SCK, PIN_ISO7816_RSTMC

/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_mem "SAM3S-EK - Memories"
 * This page lists definitions related to internal & external on-board memories.
 *
 * \section NandFlash
 * - \ref BOARD_NF_COMMAND_ADDR
 * - \ref BOARD_NF_ADDRESS_ADDR
 * - \ref BOARD_NF_DATA_ADDR
 *
 * \section NorFlash
 * - \ref BOARD_NORFLASH_ADDR
 * - \ref BOARD_NORFLASH_DFT_BUS_SIZE
 */

/** Address for transferring command bytes to the nandflash. */
#define BOARD_NF_COMMAND_ADDR    0x60400000
/** Address for transferring address bytes to the nandflash. */
#define BOARD_NF_ADDRESS_ADDR    0x60200000
/** Address for transferring data bytes to the nandflash. */
#define BOARD_NF_DATA_ADDR       0x60000000
/* Bus width for NAND */
#define CONF_NF_BUSWIDTH         8
/* Access timing for NAND */
#define CONF_NF_SETUP_TIMING        \
    ( SMC_SETUP_NWE_SETUP( 0 )      \
      | SMC_SETUP_NCS_WR_SETUP( 1 ) \
      | SMC_SETUP_NRD_SETUP( 0 )    \
      | SMC_SETUP_NCS_RD_SETUP( 1 ) )
#define CONF_NF_PULSE_TIMING        \
    ( SMC_PULSE_NWE_PULSE( 2 )      \
      | SMC_PULSE_NCS_WR_PULSE( 3 ) \
      | SMC_PULSE_NRD_PULSE( 4 )    \
      | SMC_PULSE_NCS_RD_PULSE( 4 ) )
#define CONF_NF_CYCLE_TIMING   \
    ( SMC_CYCLE_NWE_CYCLE( 4 ) \
      | SMC_CYCLE_NRD_CYCLE( 7 ) )

/** Address for transferring command bytes to the norflash. */
#define BOARD_NORFLASH_ADDR            0x63000000
/** Default NOR bus size after power up reset */
#define BOARD_NORFLASH_DFT_BUS_SIZE    8

/*----------------------------------------------------------------------------*/

/**
 * \page sam3s_ek_chipdef "SAM3S-EK - Individual chip definition"
 * This page lists the definitions related to different chip's definition
 * located in the board.h file for the SAM3S-EK.
 *
 * \section USART
 * - \ref BOARD_PIN_USART_RXD
 * - \ref BOARD_PIN_USART_TXD
 * - \ref BOARD_PIN_USART_CTS
 * - \ref BOARD_PIN_USART_RTS
 * - \ref BOARD_PIN_USART_EN
 * - \ref BOARD_USART_BASE
 * - \ref BOARD_ID_USART
 */

/** Rtc */
#define BOARD_RTC_ID              ID_RTC

/** TWI ID for EEPROM application to use */
#define BOARD_ID_TWI_EEPROM       ID_TWI1
/** TWI Base for TWI EEPROM application to use */
#define BOARD_BASE_TWI_EEPROM     TWI1
/** TWI pins for EEPROM application to use */
#define BOARD_PINS_TWI_EEPROM     PINS_TWI1

/** USART RX pin for application */
#define BOARD_PIN_USART_RXD       PIN_USART1_RXD
/** USART TX pin for application */
#define BOARD_PIN_USART_TXD       PIN_USART1_TXD
/** USART CTS pin for application */
#define BOARD_PIN_USART_CTS       PIN_USART1_CTS
/** USART RTS pin for application */
#define BOARD_PIN_USART_RTS       PIN_USART1_RTS
/** USART ENABLE pin for application */
#define BOARD_PIN_USART_EN        PIN_USART1_EN
/** USART Base for application */
#define BOARD_USART_BASE          USART1
/** USART ID for application */
#define BOARD_ID_USART            ID_USART1

#define CONSOLE_UART              UART0
#define CONSOLE_UART_ID           ID_UART0

/* RE pin. */
#define PIN_RE_IDX                PIN_USART1_CTS_IDX
#define PIN_RE_FLAGS              ( PIO_OUTPUT_0 | PIO_DEFAULT )

/* IRDA SD pin. */
#define PIN_IRDA_SD_IDX           PIN_USART1_CTS_IDX
#define PIN_IRDA_SD_FLAGS         ( PIO_OUTPUT_1 | PIO_DEFAULT )

/* TXD pin configuration. */
#define PIN_USART_TXD_IDX         PIN_USART1_TXD_IDX
#define PIN_USART_TXD_FLAGS       ( PIO_PERIPH_A | PIO_DEFAULT )
#define PIN_USART_TXD_IO_FLAGS    ( PIO_OUTPUT_0 | PIO_DEFAULT )

/* ISO7816 example relate PIN definition. */
#define ISO7816_USART_ID          ID_USART1
#define ISO7816_USART             USART1
#define PIN_ISO7816_RST_IDX       PIO_PA15_IDX
#define PIN_ISO7816_RST_FLAG      ( PIO_OUTPUT_0 | PIO_DEFAULT )

#endif // _SAM3S_EK2_H_
